<?php

namespace Database\Seeders;

use App\Models\TestExam;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Log;

class TestExamSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    private $examQuestions = [
        '1' => [
            "يقضي أغلب وقته في أداء سلوكيات نمطية تكرارية اذا ما ترك وحيدا",
            "ينشغل بمثير محدد وبشكل شاذ",
            "يحملق في الأيدي والمواد أو الأشياء الموجودة في البيئة لمدة لا تقل عن خمس ثوان",
            "يحرك بالأصابع سريعا أمام العين لمدة خمس ثوان أو أكثر ",
            "يتحرك بسرعة واندفاع عند الانتقال من مكان الي الاخر ",
            "يحرك بالايدي أو الاصابع امام او بجانب الوجه",
            "يصدر نبرات صوت عالية (مثل ايييييييي) أو اي اصوات اخري علي سبيل الاثارة الذاتية",
            "يستخدم الالعاب او الأشياء بطريقة غير لائقة كأن يجعل السيارة تدور ، يفك أجزاء الألعاب المتحركة ",
            "يقوم بعمل الاشياء علي شكل طقوس متكررة",
            "ينخرط في اللعب بطريقة نمطية عندما يستخدم الالعاب او الأشياء",
            "يكرر أصوات غير مفهومة (هذيان – ثرثرة) مرارا وتكرارا",
            "يظهر اهتماما كبيرا وغير عادي بالجوانب الحسية لمواد اللعب أو أجزاء الجسم أو الأشياء",
            "يظهر سلوكيات قهرية لا يمكن مقاومتها",
        ],
        '2' => [
            "لا يبدأ بالمحادثات مع الأقران أو الاخرين ",
            "يعطي القليل من الاهتمام أو لا يهتم لما يقوم به الأقران",
            "يفشل في تقليد الاخرين أثناء اللعب أو عند أداء الأنشطة التعليمية",
            "لا يتبع تلميحات – إيماءات – الاخرين لتوجيه النظر لشئ ما …. (مثلا: حين يومئ أحدهم برأسه أو يشير بيده أو يستخدم  اي حركات جسدية أخري)",
            "يبدو غير مبالي بالحصول علي انتباه الاخرين ( لا يحاول الحصول علي انتباه شخص اخر أو الحفاظ عليه أ توجيهه )",
            "يظهر أدني حد من الإثارة عند التفاعل مع الاخرين ",
            "يظهر القليل من الإثارة – وقد لا تظهر تماما- عند عرض الألعاب أو الأشياء للاخرين ",
            "يبدو غير مهتم بالإشارة للاخرين عن الأشياء المحيطة بهم في البيئة",
            "يبدو وكأنه لا يرغب ، أو لا يستجيب لمحاولات الاخرين للتفاعل معهم",
            "يظهر قليلا من التواصل الاجتماعي المتبادل وقد لايظهره إطلاقا ( مثلا : يرفض قول باي باي استجابة لشخص يقول له : باي باي)",
            "لا يسعي لإقامة علاقات صداقة مع اشخاص أخرين",
            "يفشل في اللعب بشكل إبداعي أو تخيلي ",
            "يظهر القليل من الإهتمام أو لا يهتم بالأشخاص الاخرين",
        ],
        '3' => [
            "يستجيب بشكل غير لائق للمثيرات التي تتطلب روح الدعابة ( مثلا : لا يضحك علي النكات ، أفلام الكرتون والحكايات المضحكة )",
            "يعاني من صعوبة في فهم النكات",
            "يعاني من صعوبة في فهم التعبيرات العامية ",
            "يجد صعوبة في معرفة ما إذا كان شخص ما يتعمد مضايقته",
            "يجد صعوبة في فهم ما إذا كان موضع سخرية من الاخرين",
            "يجد صعوبة في فهم السبب وراء عدم حب الناس له ( فهم لماذا يتضايق منه الاخرين)",
            "يفشل في التنبؤ بالعواقب المحتملة للأحداث الاجتماعية",
            "يبدو وكأنه لايفهم أن الأشخاص الاخرين لديهم أفكار ومشاعر مختلفة عنه",
            "يبدو وكأنه لايفهم أ الشخص الاخر لا يعلم شيئا",
        ],
        '4' => [
            "يحتاج الي الكثير من الطمأنة إذا ما تغيرت الأمور أو حدث خطأ ما ",
            "يصبح سريع الإحباط عندما يفشل في عمل شئ ما",
            "يصاب بنوبات من الغضب عندما يحبط ",
            "يستاء من تغير الروتين المعتاد ",
            "يستجيب بشكل سلبي – يرفض – عندما يقدم له النصح أو النصح أو الطلب منه شئ أو يتم توجيهه ",
            "يستجيب برد فعل حاد ( مثل : البكاء الشديد ، الصراخ ونوبات الغضب ) عند سماع صوت مرتفع أو ضوضاء غير متوقعة ",
            "يصاب بنوبة من الغضب عندما لايحصل علي ما يريد بطريقته الخاصة",
            "يصاب بنوبة من الغضب عندما يخبره أحد أن يتوقف ن عمل شئ يكون مستمعا به",
        ],
        '5' => [
            "يستخدم أثناء حديثه كلمات دقيقة وبشكل استثنائى",
            "يتعلق بشدة بالمعاني الملموسة – المادية – للكلمات ",
            "يتحدث بشكل مفرط عن موضوع محدد ",
            "يظهر مهارة أو معرفة فائقة بموضوعات محددة",
            "يظهر ذاكرة ممتازة",
            "يظهر اهتماما شديدا وواسعا بموضوعات فكرية معينة",
            "يعلق بملاحظات ساذجة ( غير واع بنتائج ردود أفعال الاخرين)",
        ],
        '6' => [
            "يكرر – مصاداة – الكلمات أو العبارات شفهيا أو مع الإشارات ",
            "يكرر كلمات خارج السياق ( يكرر كلمات أو العبارات يكون قد سمعها في وقت سابق)",
            "يتحدث في المواقف المؤثرة بشكل سطحي",
            "يستخدم ( نعم و لا ) بشكل غير مناسب ، فيقول : نعم عند سؤاله عن شئ لا يحبه ، أو يقول: لا عند سؤاله عن لعبة مفضلة أو هدية يريدها",
            "يستخدم الضمائر ( هو أو هي ) بدلا من ( أنا ) عبد الإشارة الي نفسه",
            "يتحدث بشكل غير طبيعي من حيث نغمة الصوت أو المعدل ",
            "ينطق الكلمات أو العبارات المميزة ولكن بلا معني",
        ]
    ];
    private $practices = 6;

    public function run(): void
    {
        DB::table("test_exams")->truncate();
        DB::table("questions")->truncate();

        foreach ($this->examQuestions as $order => $examQuestionsArr) {
            $exam = TestExam::create([
                'name' => 'بند ' . $order,
                'order' => $order
            ]);

            foreach ($examQuestionsArr as $text) {
                DB::table('questions')->insert([
                    'test_exam_id' => $exam->id,
                    'text' => $text
                ]);
            }
        }

        $practices = range(1, $this->practices);

        //NOTE: questions are statictly typed from the client
        foreach ($practices as $order) {
            DB::table('test_exams')->insertGetId([
                'name' => 'تدريب ' . $order,
                'order' => $order,
                'type' => 'practice'
            ]);
        }
    }
}



